<?php
/*
 * Author：张桓
 * ============================================================================
 * * 版权所有 2015-2025 John_3网络科技有限公司，并保留所有权利。
 * 网站地址: http://www.John_3.com；
 * ----------------------------------------------------------------------------
 * 这不是一个自由软件！您只能在不用于商业目的的前提下对程序代码进行修改和
 * 使用；不允许对程序代码以任何形式任何目的的再发布。
 * ============================================================================
 * {supporter: yun};
 * {admin : john }
 * DATE ：2016/4/29；
 * TIME ：10:02;
 */
?>
<?php

    //定义常量ρ
    define('ρ',206264.806247096355);

    //将克拉索夫斯基椭球参数定义为常量
    define('KSa',6378245);
    define('KSb',6356863.0187730473);
    define('KSc',6399698.9017827119);
    define('KSα',(1/298.3));
    define('KSe²',0.006693421622966);
    define('KSep²',0.006738535414683);

    //将1975国际椭球参数定义为常量
    define('IUGGa',6378140);
    define('IUGGb',6356755.2881575287);
    define('IUGGc',6399596.6519880105);
    define('IUGGα',(1/298.257));
    define('IUGGe²',0.006694384999588);
    define('IUGGep²',0.006739501819473);

    //将WGS84椭球参数定义为常量
    define('WGS84a',6378137);
    define('WGS84b',6356752.3142);
    define('WGS84c',6399593.6258);
    define('WGS84α',(1/298.257223563));
    define('WGS84e²',0.00669437999013);
    define('WGS84ep²',0.00673949674227);

    //将CGCS2000中国大地坐标系椭球参数定义为常量
    define('CGCS2000a',6378137);
    define('CGCS2000b',6356752.3141);
    define('CGCS2000c',6399593.6259);
    define('CGCS2000α',(1/298.257222101));
    define('CGCS2000e²',0.00669438002290);
    define('CGCS2000ep²',0.00673949677548);
